{"id": 3463, "title": "Prediction-driven surge planning with applications in the emergency department By: Carri W. Chan , Professor of Business in the Decision, Risk and Operations Division, Columbia Business School", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20719", "recurring": "Recurring event", "description": "Abstract: Optimizing emergency department (ED) nurse staffing decisions to balance the quality of service and staffing cost can be extremely challenging, especially when there is a high level of uncertainty in patient-demand. Increasing data availability and continuing advancements in predictive analytics provide an opportunity to mitigate demand-rate uncertainty by utilizing demand forecasts. In this work, we study a two-stage prediction framework that is synchronized with the base (made months in advance) and surge (made nearly real-time) staffing decisions in the ED. We quantify the benefit of the more expensive surge staffing. We also propose a near-optimal two-stage staffing policy that is straightforward to interpret and implement. Lastly, we develop a unified framework that combines parameter estimation, real-time demand forecasts, and staffing in the ED. High fidelity ED simulation experiments demonstrate that the proposed framework can reduce staffing costs by 8% – 17% while guaranteeing timely access to care. Joint work with Jing Dong and Yue Hu.Bio: Carri W. Chan is a Professor of Business in the Decision, Risk and Operations Division and the Faculty Director of the Healthcare and Pharmaceutical Management Program at Columbia Business School. Her research is in the area of healthcare operations management. Her primary focus is in data-driven modeling of complex stochastic systems, efficient algorithmic design for queuing systems, dynamic control of stochastic processing systems, and econometric analysis of healthcare systems. Her research combines empirical and stochastic modeling to develop evidence-based approaches to improve patient flow through hospitals. She has worked with clinicians and administrators in numerous hospital systems including Northern California Kaiser Permanente, New York Presbyterian, and Montefiore Medical Center. She is the recipient of a 2014 National Science Foundation (NSF) Faculty Early Career Development Program (CAREER) award, the 2016 Production and Operations Management Society (POMS) Wickham Skinner Early Career Award, and the 2019 MSOM Young Scholar Prize. She currently serves as a co-Department Editor for the Healthcare Management Department at Management Science. She received her BS in Electrical Engineering from MIT and MS and PhD in Electrical Engineering from Stanford University.", "date": "December 06, 2021", "location": "Virtual Event", "source": "Comet"},{"id": 3464, "title": "Is importance weighting incompatible with overparametrization? By: TATSU HASHIMOTO , Assistant Professor, Computer Science Department, Stanford University", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20712", "recurring": "", "description": "Importance weighting is a classic technique to handle distribution shifts. However, prior work has presented strong empirical and theoretical evidence demonstrating that importance weights can have little to no effect on overparameterized neural networks. Is importance weighting truly incompatible with the training of overparameterized neural networks? We answer this in the negative. We show that importance weighting fails not because of the overparameterization, but instead, as a result of using exponentially-tailed losses like the logistic or cross-entropy loss. As a remedy, we show that polynomially-tailed losses restore the effects of importance reweighting in correcting distribution shifts in overparameterized models.We characterize the behavior of gradient descent on importance weighted polynomially-tailed losses with overparameterized linear models, and theoretically demonstrate the advantage of using polynomially-tailed losses in a label shift setting. Surprisingly, our theory shows that using weights that are obtained by exponentiating the classical unbiased importance weights can improve performance. Finally, we demonstrate the practical value of our analysis with neural network experiments on a subpopulation shift and a label shift dataset. Our polynomially-tailed loss consistently increases the test accuracy by 2-3%.Tatsunori Hashimoto is an Assistant Professor in the Computer Science Department at Stanford University. He is a member of the statistical machine learning and natural language processing groups at Stanford, and his research uses tools from statistics to make machine learning systems more robust and reliable — especially in challenging tasks involving natural language generation. His work has received the best paper runner-up at the International Conference on Machine Learning and the best paper at the Neural Information Processing Systems workshop on Networks. Before becoming an Assistant Professor, he was a postdoctoral researcher at Stanford with Percy Liang and John Duchi and received his Ph.D. from MIT under the supervision of Tommi Jaakkola and David Gifford.", "date": "December 07, 2021", "location": "Newell-Simon 4305 and Zoom, In Person and Virtual ET", "source": "Comet"}, {"id": 3465, "title": "What is it about AI that makes it useful for teachers and learners? By: Rose Luckin , Professor of Learner Centred Design, Institute of Education, University College London", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20706", "recurring": "", "description": "There are many ways in which AI can be used to support the teaching and learning process. For example, adaptive tutors and tutoring platforms help deliver one-to-one tutoring in particular subjects, and across the curriculum, voice-activated interfaces allow people to interact without needing to use a keyboard, and recommender systems help teachers to find the most suitable resources for their students quickly and effectively. However, for teachers to know exactly how to use AI with a group of students and for students to know how best to use AI to meet their requirements, they all need to understand something about AI. For this reason we have developed the concept of AI Readiness as a framework to support our conversations with teachers about AI and to underpin a training course aimed at providing teachers and students with a contextualised course about AI, specifically designed for people within education and training. The aim is that the course will help increase confidence within teachers and learners and enable them to make better decisions about the way they apply AI in their practice. In this talk, I will discuss some examples of the work that we have done with educational organisations using the AI readiness framework and I will explain the structure of the AI Readiness course we have developed. In the process, I will explain what it is about AI that makes it useful in education and how to know if the AI you are looking at or interacting with is likely to be useful to you.", "date": "December 07, 2021", "location": "Online", "source": "Comet"}, {"id": 3466, "title": "How Businesses Leverage Data to Engage Customers and Employees By: Margret Bjarnadottir , University of Maryland", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20699", "recurring": "", "description": "The mission of the Smith Analytics Consortium is to inspire and facilitate innovation in analytics among students, faculty, and the larger business community by providing opportunities for networking, thought leadership, and collaboration. Additionally, the Smith Analytics Consortium aims to support the mission of the Smith School by providing the perspective of business leaders and organizing co-curricular activities to enhance the Smith experience for all students — both in and out of the classroom. AGENDA • Overview of Analytics of Smith Wedad Elmaghraby will provide an overview of analytics research at Smith and the activities sponsored by the Smith Analytics Consortium (SAC). • Social Media and Content Engagement Wendy Moe will provide an overview of her research in the area of social media analytics, online behavioral dynamics, and the role of content.• Congestion in Online Marketplaces Ashish Kabra will discuss how low friction applications online marketplaces (think swiping in dating apps) can result in inefficiency and describe an empirical study with a quasi-experiment in how an intervention performs. • HR tech & Pay equity Margret Bjarnadottir will highlight some of the challenges of People Analytics and showcase how innovative use of algorithms and optimization can be used to support pay equity at an organizational level.", "date": "December 07, 2021", "location": "Online", "source": "Comet"}, {"id": 3467, "title": "AI Ethics: The Case for Including Animals By: Peter Singer and Yip Fai Tse , University Ceneter for Human Values (UCHV) ", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20578", "recurring": "", "description": "There is broad agreement about the need for the development and application of AI to be subject to ethical guidelines and constraints. Equally, there is today little dissent from the view that the way we treat animals should also be guided by ethical considerations. Within the field of AI ethics, however, there is virtually no discussion of how AI impacts animals, nor of the ethical problems to which these impacts may give rise. Self-driving cars that might encounter animals, autonomous killing drones that target animals, and AI systems now working in factory farms, are all examples of AI technologies that have real impacts on animals. We will describe what is happening currently, take a peek into the future, and analyze some ethical problems related to these AI technologies. The questions raised include:When a self-driving car hits an animal, who bears the moral responsibility? Is it morally justifiable to let drones kill animals? Is the use of AI in factory farming good or bad for the animals? If an AI technology will clearly increase the suffering of animals, should a developer reject such a project even if it is legal?", "date": "December 07, 2021", "location": "Virtual", "source": "Comet"}, {"id": 3468, "title": "Dissertation Talk: Acquiring Motor Skills Through Motion Imitation and Reinforcement Learning By: Xue Bin Peng , UC Berkeley", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20698", "recurring": "", "description": "Humans are capable of performing awe-inspiring feats of agility by drawing from a vast repertoire of diverse and sophisticated motor skills. This dynamism is sharp contrast to the narrowly specialized and rigid behaviors commonly exhibited by artificial agents in both simulated and real-world domains. How can we create agents that are able to replicate the agility, versatility, and diversity of human motor behaviors? In this talk, we present motion imitation techniques that enable agents to learn large repertoires of highly dynamic and athletic behaviors by mimicking demonstrations. We begin by presenting a motion imitation framework that enables simulated agents to imitate complex behaviors from reference motion clips, ranging from common locomotion skills such as walking and running, to more athletic behaviors such as acrobatics and martial arts. The agents learn to produce robust and life-like behaviors that are nearly indistinguishable in appearance from motions recorded from real-life actors. We then develop models that can reuse and compose skills learned through motion imitation to tackle challenging downstream tasks. In addition to developing controllers for simulated agents, our approach can also synthesize controllers for robots operating in the real world. We demonstrate the effectiveness of our approach by developing controllers for a large variety of agile locomotion skills for bipedal and quadrupedal robots.", "date": "December 07, 2021", "location": "Virtual", "source": "Comet"}, {"id": 3469, "title": "Activity Understanding of Scripted Performances By: ROBERT COLLINS , Associate Professor, Computer Science and Engineering Department, Co-Director, Laboratory for Perception, Action, and Cognition, Pennsylvania State University", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20713", "recurring": "", "description": "The PSU Taichi for Smart Health project has been doing a deep-dive into vision-based analysis of 24-form Yang-style Taichi (TaijiQuan). A key property of Taichi, shared by martial arts katas and prearranged form exercises in other sports, is practice of a scripted routine to build both mental and physical competence.  The scripted nature of routines yields strong expectations on pose and motion that can be leveraged to perform interpretation by alignment, treating one performance as a reference with annotated labels that can be transferred to new routines by spatio-temporal alignment, analogous to the way a brain atlas is used to guide spatial interpretation of medical images. I'll discuss some research aspects of this project, including: 1) Collection of a large, multi-modal dataset of 100 sequences of 24-form Yang-style Taichi, performed by 10 subjects with varying levels of experience. Each performance includes simultaneously recorded Vicon 3D marker and joint data, two synchronized and calibrated video views, and foot pressure maps measured by Tekscan F-scan insole sensors; 2) Unsupervised learning of an encoder that maps short temporal windows of 3D body pose+motion into a vectors suitable for comparison by cosine similarity/distance, enabling efficient temporal alignment of routines by dynamic time warping; and 3) Learning regression functions to predict foot pressure maps (dynamics) from body pose (kinematics), and, more generally, developing methods to estimate biomechanical information like center of pressure and base of support, two key components for assessing postural and gait stability, from vision-only sensors. This is joint work with Yanxi Liu (CSE/EE), John Challis (Kinesiology), and student members of the PSU Lab for Perception, Action and Cognition.", "date": "December 08, 2021", "location": "Virtual", "source": "Comet"},{"id": 3470, "title": "Toward Predictive Digital Twins at Scale: Mathematical Foundations and Computational Approaches By: MICHAEL KAPTEYN , Postdoctoral Fellow, Oden Institute for Computational Engineering and Sciences, University of Texas, Austin ", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20722", "recurring": "", "description": "Predictive digital twins have the potential to underpin high-consequence decision-making in complex systems by enabling asset-specific predictive modeling. In this work we propose a probabilistic graphical model as a formal mathematical representation of a digital twin and its associated physical asset. We first define an abstraction of the asset-twin system, viewing it as a coupled pair of dynamical systems evolving over time through their respective state-spaces, and interacting via observed data and control inputs. We formally define the system using a probabilistic graphical model, enabling us to draw upon well-established theory and algorithms from Bayesian inference, dynamical systems, control theory, and scientific machine learning. We demonstrate an application of the proposed foundation in which we create, calibrate, and deploy a structural digital twin of an unmanned aerial vehicle. The digital twin is imbued with predictive capabilities via physics-based reduced-order models. The probabilistic graphical model is used to dynamically update these models in response to sensor data, and to perform dynamic analysis, prediction, and decision-making, all with quantified uncertainty.", "date": "December 08, 2021", "location": "Virtual", "source": "Comet"}, {"id": 3471, "title": "Tie-Breaking and Efficiency in the Laboratory School Choice  Paper Link By: Isa Hafalir , University of Technology Sydney", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20723", "recurring": "", "description": "We consider a simple school choice problem with weak priorities where the deferred acceptance (DA) mechanism may produce inefficient stable matchings due to tie-breaking. Earlier theoretical literature proposed stable improvement cycle (SIC) and choice-augmented deferred acceptance (CADA) mechanisms to remedy inefficiencies in such environments. However, neither of the two mechanisms is strategy-proof, and an equilibrium analysis is needed to thoroughly investigate their effectiveness. In our simple environment, we theoretically analyze studentsï¿½ strategic behavior (as captured by Nash equilibria in weakly undominated strategies) when DA, SIC, and CADA are in place. We show that the efficiency gain relative to DA exists for SIC but not for CADA. We then take our environment to the laboratory andï¿½for two settings with different numbers of participantsï¿½largely confirm our predictions with the experimental data.", "date": "December 08, 2022", "location": "Tepper Quad 4242", "source": "Comet"},{"id": 3472, "title": "Using Language Models to Understand Wage Premia By: Sarah Bana , Stanford Digital Economy Lab Postdoctoral Fellow, Stanford University", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20721", "recurring": "", "description": "Investments in human capital are increasingly diverse, with the number of online courses, microcredentials, and digital badges exceeding the number of traditional postsecondary education degrees and certificates in 2020. While more workers than ever have access to learning opportunities, information about the potential effects of these certifications on earnings has not scaled at the same rate. Using a new dataset from Greenwich.HR with salary information linked to posting data from Burning Glass Technologies, I apply natural language processing (NLP) techniques to build a model that predicts salaries from job posting text with impressive accuracy. This model serves as the basis for the estimating the effect of salary premia for various characteristics, using a hedonic regression framework. I uncover the premia associated with eight in-demand certifications, in the fields of business analysis, project management, computer networking, and supply chain. Estimates range from 0.005 log points to 0.048 log points -- almost a tenfold difference for certifications considered in-demand. The real-time pricing of these attributes can provide additional information to firms and workers about how to strategically invest, improving decisions about human capital accumulation.", "date": "December 08, 2021", "location": "Virtual", "source": "Comet"}, {"id": 3473, "title": "Dissertation Talk: Adaptive Prediction and Planning for Safe and Effective Autonomous Vehicles By: Vijay Govindarajan , Electrical Engineering and Computer Sciences (EECS), UC Berkely", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20708", "recurring": "", "description": "Despite recent advances in and many potential benefits of autonomous vehicles (AVs), there still remain several challenges until wide-scale adoption. The largest gap is in trust, where both passengers and proximal road users need to feel comfortable using and sharing the road with AVs. To bridge this gap, both prediction and planning algorithms need to include high fidelity driver models. This will help AVs to integrate better in mixed roadways and behave in a manner that conforms to the expectations of human stakeholders, helping to improve trust and acceptance. We investigate algorithmic frameworks that adapt to observed behaviors and balance route efficiency with safety. After demonstrating the benefits of context-aware, data-driven, multimodal predictions both for nominal and set-based trajectory prediction, we tackle the issue of handling prediction errors made online with a confidence-aware framework. In particular, a confidence threshold is adaptively updated online based on the consistency of behaviors with the corresponding predictions. This enables the AV to make efficient route progress when faced with a consistent target vehicle, but prioritize safety faced with an erratic target vehicle. In addition to the confidence-aware approach, we present an alternative approach that incorporates feedback policies in a stochastic model predictive control framework. Benefits in metrics of mobility, comfort, and efficiency demonstrate the advantages of adaptive feedback policies for multimodal predictions.", "date": "December 09, 2021", "location": "Virtual", "source": "Comet"}, {"id": 3474, "title": "GUIRR WEBINAR: IBM's Discovery Accelerator Partnerships By: John Smith , IBM", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20694", "recurring": "", "description": "The Government-University-Industry Research Roundtable will convene a webinar to discuss the strategic goals and impact of IBM’s Discovery Accelerator Partnerships. Within the last year, IBM announced two significant partnerships that will deploy emerging technologies and advanced capabilities aimed at driving scientific discovery – the first, a ten-year partnership with Cleveland Clinic focused on discoveries in life sciences and healthcare; and the second, a five-year partnership with the United Kingdom’s Science and Technology Facilities Council, based at the Hartree National Center for Digital Innovation, which will drive innovations in life sciences, new materials development, environmental sustainability, and advanced manufacturing.During this webinar, IBM Research’s Anthony Annunziata, Director of Accelerated Discovery Incubation, and John Smith, IBM Fellow working at the intersection of AI, the Future of Computing, and Accelerated Discovery, will discuss the Discovery Accelerator approach to partnership, collaborative and interdisciplinary research, and the application of emerging computing technologies to supercharge the pace of scientific discovery.  ", "date": "December 09, 2021", "location": "Virtual", "source": "Comet"}, {"id": 3475, "title": "On Fine-Tuning of Pretrained Language Models under Limited Supervision: A Machine Learning Perspective By: Tuo Zhao , The H. Milton Stewart School of Industrial and Systems Engineering (ISyE), Georgia Institute of Technology", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20726", "recurring": "", "description": "Transfer learning has fundamentally changed the landscape of natural language processing (NLP). Many state-of-the-art models are first pre-trained on a large text corpus and then fine-tuned on downstream tasks. When we only have limited supervision for the downstream tasks, however, due to the extremely high complexity of pre-trained models, aggressive fine-tuning often causes the fine-tuned model to overfit the training data of downstream tasks and fail to generalize to unseen data. To address such a concern, we propose a new approach for fine-tuning of pretrained models to attain better generalization performance. Our proposed approach adopts three important ingredients: (1) Smoothness-inducing adversarial regularization, which effectively controls the complexity of the massive model; (2) Bregman proximal point optimization, which is an instance of trust-region algorithms and can prevent aggressive updating; (3) Differentiable programming, which can mitigate the undesired bias induced by conventional adversarial training algorithms. Our experiments show that the proposed approach significantly outperforms existing methods in multiple NLP tasks. In addition, our theoretical analysis provides some new insights of adversarial training for improving generalization.", "date": "December 09, 2021", "location": "Virtual", "source": "Comet"}, {"id": 3476, "title": "Thesis Defense: Applications of Point Process Modeling to Spiking Neurons By: YU CHEN , Ph.D. Student, Joint Ph.D. Program in Neural Computation and Machine Learning, Carnegie Mellon University", "link": "http://halley.exp.sis.pitt.edu/comet/presentColloquium.do?col_id=20714", "recurring": "", "description": "Electrophysiological measurements of neurons recorded individually, collectively, and across brain regions simultaneously have been advancing the study of biophysical properties of individual neurons, information encoding/decoding, and interactions between neuronal ensembles. The recordings are composed of sequences of action potentials, usually referred to as spike trains, which carry signals of neural activity but they are contaminated with ubiquitous Poisson-type noise and the patterns vary from neuron to neuron, time to time, and trial to trial. The discreteness and randomness of the data make point process a suitable tool for understanding the neural signals represented by spike train data. This thesis provides four applications of point process modeling to spiking neurons. The first project addresses stability of fitted point process regression models. In the second project, we aim to bridge biophysical modeling and statistical modeling by describing how ion channel conductance can affect spike train patterns. The third project studies the covariation of time-dependent population firing rate features among interacting brain regions. The fourth project focuses on the inter-spike dependency between brain areas on a trial-to-trial basis. The talk will be focusing on the third and fourth projects.", "date": "December 08, 2021", "location": "Virtual", "source": "Comet"}